Tekla Open API Reference for Tekla Structures 2025
ProfileSelectionForm Constructor (List<LibraryProfileItem>, List<ParametricProfileItem>, String)
 Creates a new instance of the ProfileSelectionForm selecting the given profile in the tree control.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ProfileSelectionForm(
	List<LibraryProfileItem> LibraryProfileItems,
	List<ParametricProfileItem> ParametricProfileItems,
	string Profile
)
Public Sub New (
	LibraryProfileItems As List(Of LibraryProfileItem),
	ParametricProfileItems As List(Of ParametricProfileItem),
	Profile As String
)
Parameters
LibraryProfileItems
Type: System.Collections.Generic.List<LibraryProfileItem>
The library profiles to be added to the dialog.
ParametricProfileItems
Type: System.Collections.Generic.List<ParametricProfileItem>
The parametric profiles to be added to the dialog.
Profile
Type: System.String
The profile that will be selected in the tree.
See Also
Reference
ProfileSelectionForm Class
ProfileSelectionForm Overload
Tekla.Structures.Dialog.UIControls Namespace